---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceAnisotropy
source: html/80909a07-6a2f-47d1-0527-b0e448e1d3b7.htm
---
# Autodesk.Revit.DB.Visual.AdvancedGlazing.SurfaceAnisotropy Property

The property labeled "Anisotropy" from the "AdvancedGlazing" schema.

## Syntax (C#)
```csharp
public static string SurfaceAnisotropy { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.